Revit 2027 API
SubTransaction.GetStatus Method
 Returns the current status of the sub-transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransactionStatus GetStatus()
Public Function GetStatus As TransactionStatus
public:
TransactionStatus GetStatus()
member GetStatus : unit -> TransactionStatus
Return Value
TransactionStatus
 The current status of the sub-transaction.
See Also
Reference
SubTransaction Class
Autodesk.Revit.DB Namespace